app/controllers/reporters_controller.rb

  def income_statement
    query = Company.all
---
SELECT COUNT(*) FROM `companies`
SELECT `companies`.* FROM `companies`

  def balance_sheet
    query = Company.all
---
SELECT COUNT(*) FROM `companies`
SELECT `companies`.* FROM `companies`

  def cash_flow_statement
    query = Company.all
---
SELECT COUNT(*) FROM `companies`

  def ratio_analysis
    query = Company.all
---
SELECT COUNT(*) FROM `companies`

  def comparative_scenario
    query = Company.all
---
SELECT COUNT(*) FROM `companies`