app/controllers/stock_hubs_controller.rb

  def home
    @companies = Company.all
---
SELECT `companies`.* FROM `companies`

  def reports
    @company = Company.find(params[:company_id])
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 3 LIMIT 1